tests/performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Load test"
  defaults:
    headers:
      content-type: 'application/json'

scenarios:
  - name: "Test API endpoints"
    flow:
      - get:
          url: "/tasks"
      - post:
          url: "/tasks"
          json:
            title: "Test Task"
            description: "Load test task"
            completed: false